tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"
brew "go"
brew "keydb"
brew "kubernetes-cli"
brew "minikube"
brew "nginx"
brew "nvm"
brew "openjdk"
brew "postgresql@14"
brew "pyenv"
brew "ranger"
brew "redis"
brew "spaceship"
brew "terraform"
brew "tfsec"
brew "vim"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "drawio"
cask "font-fira-code"
cask "github"
cask "iterm2"
cask "obsidian"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "oven.bun-vscode"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "tfsec.tfsec"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "ziyasal.vscode-open-in-github"
