tap "homebrew/bundle"
brew "nginx"
brew "nvm"
brew "postgresql@14"
brew "pyenv"
brew "ranger"
brew "redis"
brew "spaceship"
brew "terraform"
brew "tfsec"
brew "vim"
brew "zsh-syntax-highlighting"
cask "arc"
cask "dbeaver-community"
cask "docker"
cask "github"
cask "iterm2"
cask "notion"
cask "postman"
cask "spotify"
cask "visual-studio-code"
