tap "homebrew/bundle"
brew "nginx"
brew "nvm"
brew "postgresql@14"
brew "pyenv"
brew "ranger"
brew "redis"
brew "spaceship"
brew "terraform"
brew "tfsec"
brew "vim"
brew "zsh-syntax-highlighting"
cask "arc"
cask "dbeaver-community"
cask "docker"
cask "github"
cask "iterm2"
cask "notion"
cask "postman"
cask "spotify"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "Maarti.jenkins-doc"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.mssql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "octref.vetur"
vscode "PKief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "RapidAPI.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SonarSource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "tfsec.tfsec"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "ZixuanChen.vitest-explorer"
vscode "ziyasal.vscode-open-in-github"
